<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"e6791af52e7ad216d5be258f3ebb4811834b8a3537bf09df8763e5276ce3e05c","plan_job_ref":"Job Infrastructure #320 at https://github.com/coverage-robot/core/actions/runs/7401790766","plan_hash":"08303e2b12589c8ac64d8b7048d7115954f8cad2f0ee67ce40c4ee8b78f77ad6","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.warehouse.google_bigquery_table.coverage will be created
+   resource "google_bigquery_table" "coverage" {
+       clustering          = [
+           "uploadId",
+           "fileName",
        ]
+       creation_time       = (known after apply)
+       dataset_id          = "****"
+       deletion_protection = false
+       effective_labels    = (known after apply)
+       etag                = (known after apply)
+       expiration_time     = (known after apply)
+       id                  = (known after apply)
+       last_modified_time  = (known after apply)
+       location            = (known after apply)
+       num_bytes           = (known after apply)
+       num_long_term_bytes = (known after apply)
+       num_rows            = (known after apply)
+       project             = "coverage-384615"
+       schema              = jsonencode(
            [
+               {
+                   description = "The unique upload id for the uploaded file."
+                   mode        = "REQUIRED"
+                   name        = "uploadId"
+                   type        = "STRING"
                },
+               {
+                   description = "The commit hash which the coverage was generated for."
+                   mode        = "REQUIRED"
+                   name        = "commit"
+                   type        = "STRING"
                },
+               {
+                   description = "The parent commit hash(es) of the commit the coverage was generated for."
+                   mode        = "REPEATED"
+                   name        = "parent"
+                   type        = "STRING"
                },
+               {
+                   description = "The ref (e.g. branch) in the VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "ref"
+                   type        = "STRING"
                },
+               {
+                   description = "The original format of the coverage file ingested."
+                   mode        = "REQUIRED"
+                   name        = "sourceFormat"
+                   type        = "STRING"
                },
+               {
+                   description = "The total number of lines ingested from the coverage file."
+                   mode        = "REQUIRED"
+                   name        = "totalLines"
+                   type        = "INTEGER"
                },
+               {
+                   description = "The path of the file which the line exists in."
+                   mode        = "REQUIRED"
+                   name        = "fileName"
+                   type        = "STRING"
                },
+               {
+                   description = "The number of the line."
+                   mode        = "REQUIRED"
+                   name        = "lineNumber"
+                   type        = "INTEGER"
                },
+               {
+                   description = "The type of the line coverage."
+                   mode        = "REQUIRED"
+                   name        = "type"
+                   type        = "STRING"
                },
+               {
+                   description = "The user provided tag of the coverage file."
+                   mode        = "REQUIRED"
+                   name        = "tag"
+                   type        = "STRING"
                },
+               {
+                   description = "The repository owner for the VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "owner"
+                   type        = "STRING"
                },
+               {
+                   description = "The repository name for the VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "repository"
+                   type        = "STRING"
                },
+               {
+                   description = "The VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "provider"
+                   type        = "STRING"
                },
+               {
+                   description = "The lines metadata."
+                   fields      = [
+                       {
+                           mode = "REQUIRED"
+                           name = "key"
+                           type = "STRING"
                        },
+                       {
+                           mode = "NULLABLE"
+                           name = "value"
+                           type = "STRING"
                        },
                    ]
+                   mode        = "REPEATED"
+                   name        = "metadata"
+                   type        = "RECORD"
                },
+               {
+                   description = "The time the coverage was generated."
+                   mode        = "NULLABLE"
+                   name        = "generatedAt"
+                   type        = "DATETIME"
                },
+               {
+                   description = "The number of the line."
+                   mode        = "NULLABLE"
+                   name        = "ingestTime"
+                   type        = "DATETIME"
                },
            ]
        )
+       self_link           = (known after apply)
+       table_id            = "*************"
+       terraform_labels    = (known after apply)
+       type                = (known after apply)

+       time_partitioning {
+           expiration_ms = (known after apply)
+           field         = "ingestTime"
+           type          = "DAY"
        }
    }

  # module.warehouse.google_bigquery_table.line_coverage will be destroyed
  # (because google_bigquery_table.line_coverage is not in configuration)
-   resource "google_bigquery_table" "line_coverage" {
-       clustering               = [
-           "uploadId",
-           "fileName",
        ] -> null
-       creation_time            = 1704307621352 -> null
-       dataset_id               = "prod" -> null
-       deletion_protection      = false -> null
-       effective_labels         = {} -> null
-       etag                     = "GkEAKkq/YGkyPbGLSgAm/g==" -> null
-       expiration_time          = 0 -> null
-       id                       = "projects/coverage-384615/datasets/prod/tables/line_coverage" -> null
-       labels                   = {} -> null
-       last_modified_time       = 1704310713911 -> null
-       location                 = "EU" -> null
-       num_bytes                = 1179536534881 -> null
-       num_long_term_bytes      = 0 -> null
-       num_rows                 = 2792608895 -> null
-       project                  = "coverage-384615" -> null
-       require_partition_filter = false -> null
-       schema                   = jsonencode(
            [
-               {
-                   description = "The unique upload id for the uploaded file."
-                   mode        = "REQUIRED"
-                   name        = "uploadId"
-                   type        = "STRING"
                },
-               {
-                   description = "The commit hash which the coverage was generated for."
-                   mode        = "REQUIRED"
-                   name        = "commit"
-                   type        = "STRING"
                },
-               {
-                   description = "The parent commit hash(es) of the commit the coverage was generated for."
-                   mode        = "REPEATED"
-                   name        = "parent"
-                   type        = "STRING"
                },
-               {
-                   description = "The ref (e.g. branch) in the VCS provider."
-                   mode        = "REQUIRED"
-                   name        = "ref"
-                   type        = "STRING"
                },
-               {
-                   description = "The original format of the coverage file ingested."
-                   mode        = "REQUIRED"
-                   name        = "sourceFormat"
-                   type        = "STRING"
                },
-               {
-                   description = "The total number of lines ingested from the coverage file."
-                   mode        = "REQUIRED"
-                   name        = "totalLines"
-                   type        = "INTEGER"
                },
-               {
-                   description = "The path of the file which the line exists in."
-                   mode        = "REQUIRED"
-                   name        = "fileName"
-                   type        = "STRING"
                },
-               {
-                   description = "The number of the line."
-                   mode        = "REQUIRED"
-                   name        = "lineNumber"
-                   type        = "INTEGER"
                },
-               {
-                   description = "The type of the line coverage."
-                   mode        = "REQUIRED"
-                   name        = "type"
-                   type        = "STRING"
                },
-               {
-                   description = "The user provided tag of the coverage file."
-                   mode        = "REQUIRED"
-                   name        = "tag"
-                   type        = "STRING"
                },
-               {
-                   description = "The repository owner for the VCS provider."
-                   mode        = "REQUIRED"
-                   name        = "owner"
-                   type        = "STRING"
                },
-               {
-                   description = "The repository name for the VCS provider."
-                   mode        = "REQUIRED"
-                   name        = "repository"
-                   type        = "STRING"
                },
-               {
-                   description = "The VCS provider."
-                   mode        = "REQUIRED"
-                   name        = "provider"
-                   type        = "STRING"
                },
-               {
-                   description = "The lines metadata."
-                   fields      = [
-                       {
-                           mode = "REQUIRED"
-                           name = "key"
-                           type = "STRING"
                        },
-                       {
-                           mode = "NULLABLE"
-                           name = "value"
-                           type = "STRING"
                        },
                    ]
-                   mode        = "REPEATED"
-                   name        = "metadata"
-                   type        = "RECORD"
                },
-               {
-                   description = "The time the coverage was generated."
-                   mode        = "NULLABLE"
-                   name        = "generatedAt"
-                   type        = "DATETIME"
                },
-               {
-                   description = "The number of the line."
-                   mode        = "NULLABLE"
-                   name        = "ingestTime"
-                   type        = "DATETIME"
                },
            ]
        ) -> null
-       self_link                = "https://bigquery.googleapis.com/bigquery/v2/projects/coverage-384615/datasets/prod/tables/line_coverage" -> null
-       table_id                 = "line_coverage" -> null
-       terraform_labels         = {} -> null
-       type                     = "TABLE" -> null

-       time_partitioning {
-           expiration_ms            = 0 -> null
-           field                    = "ingestTime" -> null
-           require_partition_filter = false -> null
-           type                     = "DAY" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  line_coverage_table       = {
!~      creation_time               = 1693775867466 -> (known after apply)
!~      description                 = "" -> null
!~      effective_labels            = {} -> (known after apply)
!~      etag                        = "j1/+fb59Aut+tsuCm2PsJA==" -> (known after apply)
!~      expiration_time             = 0 -> (known after apply)
!~      friendly_name               = "" -> null
!~      id                          = "***********************************************************" -> (known after apply)
!~      labels                      = {} -> null
!~      last_modified_time          = 1704307337360 -> (known after apply)
!~      location                    = "EU" -> (known after apply)
!~      max_staleness               = "" -> null
!~      num_bytes                   = 1179535761585 -> (known after apply)
!~      num_long_term_bytes         = 0 -> (known after apply)
!~      num_rows                    = 2792606797 -> (known after apply)
!~      require_partition_filter    = false -> null
!~      self_link                   = "https://bigquery.googleapis.com/bigquery/v2/projects/coverage-384615/datasets/prod/tables/line_coverage" -> (known after apply)
!~      terraform_labels            = {} -> (known after apply)
!~      time_partitioning           = [
+           {
+               expiration_ms            = (known after apply)
+               field                    = "ingestTime"
+               require_partition_filter = null
+               type                     = "DAY"
            },
        ]
!~      type                        = "TABLE" -> (known after apply)
#        (12 unchanged attributes hidden)
    }
!~  upload_table              = {
        id                          = "projects/coverage-384615/datasets/prod/tables/upload"
!~      last_modified_time          = 1704305282932 -> 1704308884359
!~      num_bytes                   = 8156367 -> 8163123
!~      num_rows                    = 33441 -> 33469
#        (27 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #320](https://github.com/coverage-robot/core/actions/runs/7401790766)